ocaml-book/ch4/ex.org
#+include: ../../mytheme.setup 

* ch4

**  
#+begin_src ocaml
let double x = 2*x
let square x = x*x
let twice f x = f (f x)
let quad = twice double
let fourth = twice square
#+end_src
确定 quad 和forth的类型,
val quad : int -> int = <fun>
val fourth : int -> int = <fun>

twice部分应用,仅传入一个double,返回一个函数: 
val twice : ('a -> 'a) -> 'a -> 'a = <fun>

'a -> 'a = <fun> 


** mystery operator 1
下面这个运算符的作用是?
#+begin_src ocaml
let ( $ ) f x = f x 
#+end_src
分割了函数和参数部分,并应用f到x上
#+begin_src ocaml
# square 2+2 ;;
- : int = 6
# square $ 2+2 ;;
- : int = 16
#+end_src

** mystery operator 2

#+begin_src ocaml
let ( @@ ) f g x = x |> g |> f
#+end_src
作用是函数复合: =f@@g(x) == f(g(x))= 


** repeat
编写函数repeat满足: repeat f n x 的效果是f应用于x上n次
例如: =repeat f 3 x  -->  f (f (f x))=
=repeat f 0 x  -> x=
#+begin_src ocaml
  let rec repeat f n x =
    if n > 0
    then repeat f (n-1) (f x)
    else x
  ;;
#+end_src

** product
用 =fold_left/fold_right= 编写函数  ~product_left/product_right~ , 它能计算list中的所有浮点数之积. 规定空list的积为1.0
#+begin_src ocaml

   let fold_left f init lst =
    let rec impl acc f = function
      |[] -> acc
      |h::t -> impl (f acc h) f t
    in
    impl init f lst
  ;;
#+end_src

#+begin_src ocaml
  let product_left flst =
    fold_left (fun acc f -> acc*.f) 1.0 flst
  ;;
#+end_src
#+begin_src ocaml
  let product_right flst =
    List.fold_right (fun acc f -> acc *. f) flst 1.0
  ;;
#+end_src

** terse product
尽量让你的上一问的解答变得简洁.
提示: 是否能省略 =fun= ,是否能省略 =lst= 参数.
#+begin_src ocaml
  let product_left  = fold_left ( *. ) 1.  ;;
#+end_src
#+begin_src ocaml
  let product_right flst = List.fold_right ( *. ) flst 1. ;;
#+end_src

** =sum_cube_odd= 
计算 0-n的立方和, 不要自己编写递归函数, 使用 =map, fold, filter, ( -- )operator=
#+begin_src ocaml

  let sum_cube_odd n =
    let lst = 0 -- n in
      fold_left ( + ) 0 (map (fun x -> x*x*x) lst)
  ;;
#+end_src


** =sum_cube_odd= pipeline
用 =|>= 重写上一题

#+begin_src ocaml
 let sum_cube_odd_pipeline  n =
    let lst = 0 -- n in
      lst |> map (fun x -> x*x*x) |> fold_left ( + ) 0 
  ;;
#+end_src

