ocaml-book/ch4/ex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-27 五 23:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="../../org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org61be321">1. ch4</a>
<ul>
<li><a href="#orgaa4c1fb">1.1. </a></li>
<li><a href="#org00ebe16">1.2. mystery operator 1</a></li>
<li><a href="#org645ae00">1.3. mystery operator 2</a></li>
<li><a href="#org37ed791">1.4. repeat</a></li>
<li><a href="#orge3efa78">1.5. product</a></li>
<li><a href="#orga0c37a8">1.6. terse product</a></li>
<li><a href="#orgb7a3cf5">1.7. <code>sum_cube_odd</code></a></li>
<li><a href="#orgdf0f025">1.8. <code>sum_cube_odd</code> pipeline</a></li>
<li><a href="#org1ff43e9">1.9. exists</a></li>
<li><a href="#orge56de72">1.10. account balance</a></li>
<li><a href="#org823def6">1.11. library uncurried</a></li>
<li><a href="#orged7ab4a">1.12. map composition</a></li>
<li><a href="#orga816fcc">1.13. more list fun</a></li>
<li><a href="#org706e786">1.14. association list keys</a></li>
<li><a href="#org90a3420">1.15. valid matrix</a></li>
<li><a href="#org65f36e6">1.16. row vector add</a></li>
<li><a href="#org24f31f0">1.17. matrix add</a></li>
<li><a href="#orgc9651da">1.18. matrix multiply</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org61be321" class="outline-2">
<h2 id="org61be321"><span class="section-number-2">1.</span> ch4</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgaa4c1fb" class="outline-3">
<h3 id="orgaa4c1fb"><span class="section-number-3">1.1.</span> </h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">double</span><span style="color: #DFDFDF;"> x</span> <span style="color: #f0e68c;">=</span> 2<span style="color: #f0e68c;">*</span>x
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">square</span><span style="color: #DFDFDF;"> x</span> <span style="color: #f0e68c;">=</span> x<span style="color: #f0e68c;">*</span>x
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">twice</span><span style="color: #DFDFDF;"> f x</span> <span style="color: #f0e68c;">=</span> f <span style="color: #f0e68c;">(</span>f x<span style="color: #f0e68c;">)</span>
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">quad</span> <span style="color: #f0e68c;">=</span> twice double
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">fourth</span> <span style="color: #f0e68c;">=</span> twice square
</pre>
</div>
<p>
确定 quad 和forth的类型,
val quad : int -&gt; int = &lt;fun&gt;
val fourth : int -&gt; int = &lt;fun&gt;
</p>

<p>
twice部分应用,仅传入一个double,返回一个函数: 
val twice : ('a -&gt; 'a) -&gt; 'a -&gt; 'a = &lt;fun&gt;
</p>

<p>
'a -&gt; 'a = &lt;fun&gt; 
</p>
</div>
</div>


<div id="outline-container-org00ebe16" class="outline-3">
<h3 id="org00ebe16"><span class="section-number-3">1.2.</span> mystery operator 1</h3>
<div class="outline-text-3" id="text-1-2">
<p>
下面这个运算符的作用是?
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f0e68c;">(</span> $ <span style="color: #f0e68c;">)</span> f x <span style="color: #f0e68c;">=</span> f x 
</pre>
</div>
<p>
分割了函数和参数部分,并应用f到x上
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f0e68c;">#</span> square 2<span style="color: #f0e68c;">+</span>2 <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 6
<span style="color: #f0e68c;">#</span> square $ 2<span style="color: #f0e68c;">+</span>2 <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 16
</pre>
</div>
</div>
</div>

<div id="outline-container-org645ae00" class="outline-3">
<h3 id="org645ae00"><span class="section-number-3">1.3.</span> mystery operator 2</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">@@</span> <span style="color: #f0e68c;">)</span> f g x <span style="color: #f0e68c;">=</span> x <span style="color: #f0e68c;">|&gt;</span> g <span style="color: #f0e68c;">|&gt;</span> f
</pre>
</div>
<p>
作用是函数复合: <code>f@@g(x) =</code> f(g(x))= 
</p>
</div>
</div>


<div id="outline-container-org37ed791" class="outline-3">
<h3 id="org37ed791"><span class="section-number-3">1.4.</span> repeat</h3>
<div class="outline-text-3" id="text-1-4">
<p>
编写函数repeat满足: repeat f n x 的效果是f应用于x上n次
例如: <code>repeat f 3 x  --&gt;  f (f (f x))</code>
<code>repeat f 0 x  -&gt; x</code>
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">repeat</span><span style="color: #DFDFDF;"> f n x</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> n <span style="color: #f0e68c;">&gt;</span> 0
  <span style="color: #51afef;">then</span> repeat f <span style="color: #f0e68c;">(</span>n<span style="color: #f0e68c;">-</span>1<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">(</span>f x<span style="color: #f0e68c;">)</span>
  <span style="color: #51afef;">else</span> x
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge3efa78" class="outline-3">
<h3 id="orge3efa78"><span class="section-number-3">1.5.</span> product</h3>
<div class="outline-text-3" id="text-1-5">
<p>
用 <code>fold_left/fold_right</code> 编写函数  <code>product_left/product_right</code> , 它能计算list中的所有浮点数之积. 规定空list的积为1.0
</p>
<div class="org-src-container">
<pre class="src src-ocaml">
 <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">fold_left</span><span style="color: #DFDFDF;"> f init lst</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">impl</span><span style="color: #DFDFDF;"> acc f</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span>
    <span style="color: #f0e68c;">|[]</span> <span style="color: #f0e68c;">-&gt;</span> acc
    <span style="color: #f0e68c;">|</span>h<span style="color: #f0e68c;">::</span>t <span style="color: #f0e68c;">-&gt;</span> impl <span style="color: #f0e68c;">(</span>f acc h<span style="color: #f0e68c;">)</span> f t
  <span style="color: #f5deb3; font-weight: bold;">in</span>
  impl init f lst
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">product_left</span><span style="color: #DFDFDF;"> flst</span> <span style="color: #f0e68c;">=</span>
  fold_left <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">acc f</span> <span style="color: #f0e68c;">-&gt;</span> acc<span style="color: #f0e68c;">*.</span>f<span style="color: #f0e68c;">)</span> 1.0 flst
<span style="color: #ff4500;">;;</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">product_right</span><span style="color: #DFDFDF;"> flst</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #FCCE7B;">List.</span>fold_right <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">acc f</span> <span style="color: #f0e68c;">-&gt;</span> acc <span style="color: #f0e68c;">*.</span> f<span style="color: #f0e68c;">)</span> flst 1.0
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga0c37a8" class="outline-3">
<h3 id="orga0c37a8"><span class="section-number-3">1.6.</span> terse product</h3>
<div class="outline-text-3" id="text-1-6">
<p>
尽量让你的上一问的解答变得简洁.
提示: 是否能省略 <code>fun</code> ,是否能省略 <code>lst</code> 参数.
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">product_left</span>  <span style="color: #f0e68c;">=</span> fold_left <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">*.</span> <span style="color: #f0e68c;">)</span> 1.  <span style="color: #ff4500;">;;</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">product_right</span><span style="color: #DFDFDF;"> flst</span> <span style="color: #f0e68c;">=</span> <span style="color: #FCCE7B;">List.</span>fold_right <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">*.</span> <span style="color: #f0e68c;">)</span> flst 1. <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb7a3cf5" class="outline-3">
<h3 id="orgb7a3cf5"><span class="section-number-3">1.7.</span> <code>sum_cube_odd</code></h3>
<div class="outline-text-3" id="text-1-7">
<p>
计算 0-n的立方和, 不要自己编写递归函数, 使用 <code>map, fold, filter, ( -- )operator</code>
</p>
<div class="org-src-container">
<pre class="src src-ocaml">
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">sum_cube_odd</span><span style="color: #DFDFDF;"> n</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">lst</span> <span style="color: #f0e68c;">=</span> 0 <span style="color: #f0e68c;">--</span> n <span style="color: #f5deb3; font-weight: bold;">in</span>
    fold_left <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">+</span> <span style="color: #f0e68c;">)</span> 0 <span style="color: #f0e68c;">(</span>map <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">x</span> <span style="color: #f0e68c;">-&gt;</span> x<span style="color: #f0e68c;">*</span>x<span style="color: #f0e68c;">*</span>x<span style="color: #f0e68c;">)</span> lst<span style="color: #f0e68c;">)</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgdf0f025" class="outline-3">
<h3 id="orgdf0f025"><span class="section-number-3">1.8.</span> <code>sum_cube_odd</code> pipeline</h3>
<div class="outline-text-3" id="text-1-8">
<p>
用 <code>|&gt;</code> 重写上一题
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">sum_cube_odd_pipeline</span><span style="color: #DFDFDF;">  n</span> <span style="color: #f0e68c;">=</span>
   <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">lst</span> <span style="color: #f0e68c;">=</span> 0 <span style="color: #f0e68c;">--</span> n <span style="color: #f5deb3; font-weight: bold;">in</span>
     lst <span style="color: #f0e68c;">|&gt;</span> map <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">x</span> <span style="color: #f0e68c;">-&gt;</span> x<span style="color: #f0e68c;">*</span>x<span style="color: #f0e68c;">*</span>x<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">|&gt;</span> fold_left <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">+</span> <span style="color: #f0e68c;">)</span> 0 
 <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
