ocaml-book/ch4/ex.org
** exists

编写函数 =exists: ('a -> bool) -> 'a list -> bool= ,
使得 =exists p [a1; ...; an]= 返回 list中是否至少有一个元素满足谓词p
即要计算 =(p a1) || (p a2) || ... || (p an)=
对空list, 此函数返回false

编写三个版本的解答:
+ =exists_rec= , 它是一个递归函数, 且不用到List模块
+ =exists_fold= , 它只能用List模块中的fold函数,并且实现中不能出现 =rec=
+ =exists_lib= , 它使用除 =fold_left= 或 ~fold_right~ 之外的 List 模块函数的任意组合，并且不使用  ~rec~  关键字。

#+begin_src ocaml
  let rec exists_rec p  = function 
    |[] -> false 
    |h::t -> (p h) || exists_rec t
  ;;
#+end_src
#+begin_src ocaml
  let exists_fold p lst =
    List.fold_left (fun acc e -> (p e) || acc) false lst  ;;
#+end_src
#+begin_src ocaml
  let exists_lib = List.exists;;
#+end_src

** account balance
编写三个版本的函数: =fold_left= , =fold_right= ,直接编写递归函数
满足: 对一个表示借款的数字list, 从账户余额中扣除这些借款, 并返回剩下的额度
#+begin_src ocaml
  let rec account_balance1 acc lst =
    match (acc , lst) with
    | (a , _ ) when a <= 0 -> 0
    | (a , [])  -> a
    | (a, h::t ) -> account_balance1 (a-h) t
  ;;
#+end_src
#+begin_src ocaml
  let account_balance2 account lst =
    List.fold_left (fun acc e -> if acc>e then (acc - e) else 0) account lst
  ;;
#+end_src

#+begin_src ocaml
  let account_balance3 account lst =
    List.fold_right  (fun e acc  -> if acc>e then (acc - e) else 0) lst account 
  ;;
#+end_src




** library uncurried

这是List.nth的uncurried版本: 

#+begin_src ocaml
let uncurried_nth (lst, n) = List.nth lst n
#+end_src

为下面的库函数编写uncurried版本:

+ =List.append=
#+begin_src ocaml
let uncurried_append (h,t) = List.append h t ;;
#+end_src

+ =Char.compare=
#+begin_src ocaml
let uncurried_char_compare (c1 , c2) = Char.compare c1 c2 ;;
#+end_src

+ =Stdlib.max=
#+begin_src ocaml
let uncurried_stdlib_max (fst,snd) = Stdlib.max fst snd ;;
#+end_src


更统一的写法: 
#+begin_src ocaml
  let uncurried_two_args  f2 (fst,snd) =  f2 fst snd  ;;

  uncurried_two_args List.append ;;
  uncurried_two_args Char.compare ;;
  uncurried_two_args Stdlib.max ;;
#+end_src



** map composition
将 =List.map f (List.map g lst)= 替换为只需要进行一次 =List.map= 调用的表达式
#+begin_src ocaml
  let map_compose f g lst =
    let ( @@ ) f g x = x |> g |> f  in 
    List.map (f@@g ) lst
  ;;
#+end_src

