ocaml-book/ch4/ex.html

<div id="outline-container-org1ff43e9" class="outline-3">
<h3 id="org1ff43e9"><span class="section-number-3">1.9.</span> exists</h3>
<div class="outline-text-3" id="text-1-9">
<p>
编写函数 <code>exists: ('a -&gt; bool) -&gt; 'a list -&gt; bool</code> ,
使得 <code>exists p [a1; ...; an]</code> 返回 list中是否至少有一个元素满足谓词p
即要计算 <code>(p a1) || (p a2) || ... || (p an)</code>
对空list, 此函数返回false
</p>

<p>
编写三个版本的解答:
</p>
<ul class="org-ul">
<li><code>exists_rec</code> , 它是一个递归函数, 且不用到List模块</li>
<li><code>exists_fold</code> , 它只能用List模块中的fold函数,并且实现中不能出现 <code>rec</code></li>
<li><code>exists_lib</code> , 它使用除 <code>fold_left</code> 或 <code>fold_right</code> 之外的 List 模块函数的任意组合，并且不使用  <code>rec</code>  关键字。</li>
</ul>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">exists_rec</span><span style="color: #DFDFDF;"> p</span>  <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span> 
  <span style="color: #f0e68c;">|[]</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #a991f1;">false</span> 
  <span style="color: #f0e68c;">|</span>h<span style="color: #f0e68c;">::</span>t <span style="color: #f0e68c;">-&gt;</span> <span style="color: #f0e68c;">(</span>p h<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">||</span> exists_rec t
<span style="color: #ff4500;">;;</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">exists_fold</span><span style="color: #DFDFDF;"> p lst</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #FCCE7B;">List.</span>fold_left <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">acc e</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #f0e68c;">(</span>p e<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">||</span> acc<span style="color: #f0e68c;">)</span> <span style="color: #a991f1;">false</span> lst  <span style="color: #ff4500;">;;</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">exists_lib</span> <span style="color: #f0e68c;">=</span> <span style="color: #FCCE7B;">List.</span>exists<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge56de72" class="outline-3">
<h3 id="orge56de72"><span class="section-number-3">1.10.</span> account balance</h3>
<div class="outline-text-3" id="text-1-10">
<p>
编写三个版本的函数: <code>fold_left</code> , <code>fold_right</code> ,直接编写递归函数
满足: 对一个表示借款的数字list, 从账户余额中扣除这些借款, 并返回剩下的额度
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">account_balance1</span><span style="color: #DFDFDF;"> acc lst</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">match</span> <span style="color: #f0e68c;">(</span>acc <span style="color: #f0e68c;">,</span> lst<span style="color: #f0e68c;">)</span> <span style="color: #51afef;">with</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">(</span>a <span style="color: #f0e68c;">,</span> _ <span style="color: #f0e68c;">)</span> <span style="color: #51afef;">when</span> a <span style="color: #f0e68c;">&lt;=</span> 0 <span style="color: #f0e68c;">-&gt;</span> 0
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">(</span>a <span style="color: #f0e68c;">,</span> <span style="color: #f0e68c;">[])</span>  <span style="color: #f0e68c;">-&gt;</span> a
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">(</span>a<span style="color: #f0e68c;">,</span> h<span style="color: #f0e68c;">::</span>t <span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">-&gt;</span> account_balance1 <span style="color: #f0e68c;">(</span>a<span style="color: #f0e68c;">-</span>h<span style="color: #f0e68c;">)</span> t
<span style="color: #ff4500;">;;</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">account_balance2</span><span style="color: #DFDFDF;"> account lst</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #FCCE7B;">List.</span>fold_left <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">acc e</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #51afef;">if</span> acc<span style="color: #f0e68c;">&gt;</span>e <span style="color: #51afef;">then</span> <span style="color: #f0e68c;">(</span>acc <span style="color: #f0e68c;">-</span> e<span style="color: #f0e68c;">)</span> <span style="color: #51afef;">else</span> 0<span style="color: #f0e68c;">)</span> account lst
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">account_balance3</span><span style="color: #DFDFDF;"> account lst</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #FCCE7B;">List.</span>fold_right  <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">e acc</span>  <span style="color: #f0e68c;">-&gt;</span> <span style="color: #51afef;">if</span> acc<span style="color: #f0e68c;">&gt;</span>e <span style="color: #51afef;">then</span> <span style="color: #f0e68c;">(</span>acc <span style="color: #f0e68c;">-</span> e<span style="color: #f0e68c;">)</span> <span style="color: #51afef;">else</span> 0<span style="color: #f0e68c;">)</span> lst account 
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>




<div id="outline-container-org823def6" class="outline-3">
<h3 id="org823def6"><span class="section-number-3">1.11.</span> library uncurried</h3>
<div class="outline-text-3" id="text-1-11">
<p>
这是List.nth的uncurried版本: 
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">uncurried_nth</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">lst</span><span style="color: #f0e68c;">,</span><span style="color: #DFDFDF;"> n</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">=</span> <span style="color: #FCCE7B;">List.</span>nth lst n
</pre>
</div>

<p>
为下面的库函数编写uncurried版本:
</p>

<ul class="org-ul">
<li><code>List.append</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">uncurried_append</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">h</span><span style="color: #f0e68c;">,</span><span style="color: #DFDFDF;">t</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">=</span> <span style="color: #FCCE7B;">List.</span>append h t <span style="color: #ff4500;">;;</span>
</pre>
</div>

<ul class="org-ul">
<li><code>Char.compare</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">uncurried_char_compare</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">c1 </span><span style="color: #f0e68c;">,</span><span style="color: #DFDFDF;"> c2</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">=</span> <span style="color: #FCCE7B;">Char.</span>compare c1 c2 <span style="color: #ff4500;">;;</span>
</pre>
</div>

<ul class="org-ul">
<li><code>Stdlib.max</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">uncurried_stdlib_max</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">fst</span><span style="color: #f0e68c;">,</span><span style="color: #DFDFDF;">snd</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">=</span> <span style="color: #FCCE7B;">Stdlib.</span>max fst snd <span style="color: #ff4500;">;;</span>
</pre>
</div>


<p>
更统一的写法: 
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">uncurried_two_args</span><span style="color: #DFDFDF;">  f2 </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">fst</span><span style="color: #f0e68c;">,</span><span style="color: #DFDFDF;">snd</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">=</span>  f2 fst snd  <span style="color: #ff4500;">;;</span>

uncurried_two_args <span style="color: #FCCE7B;">List.</span>append <span style="color: #ff4500;">;;</span>
uncurried_two_args <span style="color: #FCCE7B;">Char.</span>compare <span style="color: #ff4500;">;;</span>
uncurried_two_args <span style="color: #FCCE7B;">Stdlib.</span>max <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>



<div id="outline-container-orged7ab4a" class="outline-3">
<h3 id="orged7ab4a"><span class="section-number-3">1.12.</span> map composition</h3>
<div class="outline-text-3" id="text-1-12">
<p>
将 <code>List.map f (List.map g lst)</code> 替换为只需要进行一次 <code>List.map</code> 调用的表达式
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">map_compose</span><span style="color: #DFDFDF;"> f g lst</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">@@</span> <span style="color: #f0e68c;">)</span> f g x <span style="color: #f0e68c;">=</span> x <span style="color: #f0e68c;">|&gt;</span> g <span style="color: #f0e68c;">|&gt;</span> f  <span style="color: #f5deb3; font-weight: bold;">in</span> 
  <span style="color: #FCCE7B;">List.</span>map <span style="color: #f0e68c;">(</span>f<span style="color: #f0e68c;">@@</span>g <span style="color: #f0e68c;">)</span> lst
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
