ocaml-book/ch4/ex.org
** more list fun

每次只用 =List.fold / List.map / List.filter= 中的一个编写下面的函数
+ 找出list中那些长度>3的字符串
+ 为list中的每个元素加上 1.0
+ 给定一个字符串的list =strs= ,以及一个字符串 =sep= , 生成一个由 =strs= 中的字符串组成且用 =sep= 分割的长字符串.
  (确保没有多余的 =sep= )

#+begin_src ocaml
  let len_greater_then_three strs =
    List.filter (fun s -> String.length s >3) strs ;;
#+end_src
  
#+begin_src ocaml
  let add_float_one lst =
    List.map (fun x -> x +. 1.0) lst ;;
#+end_src

#+begin_src ocaml
  let concat_with_sep sep = function 
    | [] -> ""
    | h::t -> List.fold_left (fun acc e -> acc ^ sep ^ e) h t 
  ;;
#+end_src

  
** association list keys
association list 是一种字典的实现, 它是以pair为元素的list.
编写函数 =keys: ('a * 'b) list -> 'a list= 根据association list返回由不重复的key构成的list
keys的顺序没有要求.
尽可能用一行实现该函数,并且其时间和空间复杂度都是线性的.
(提示: 使用 =List.sort_uniq= )

#+begin_src ocaml
  let keys dict =
    dict |> List.map (fun (k,v) -> k) |> List.sort_uniq Stdlib.compare ;;
#+end_src


** valid matrix
用行向量的形式表示下面的矩阵为 =[[1; 1; 1]; [9; 8; 7]]=

\begin{split} \begin{bmatrix} 1 & 1 & 1 \\ 9 & 8 & 7 \end{bmatrix} \end{split}

一个有效的矩阵是一个至少有一行一列的 =int list list= ,且每列有相同的行数

下面这两个矩阵的表示都是无效的
+ =[]= 
+ =[[1; 2]; [3]]=
实现一个函数 =is_valid_matrix: int list list -> bool= ,它返回输入的矩阵表示是否有效.
并为该函数编写单元测试.

#+begin_src ocaml
  open OUnit2
  open Stdlib

  let is_valid_matrix  = function
      |[] -> false
      |[[]] -> false 
      |r::rows -> let l = List.length r in
	 List.fold_left (fun acc e ->  (l!=0) && (List.length e = l)  && acc)  true rows
	   
  (**************************UNIT TEST****************************)
  let make_test_case  name expected matrix =
    name >:: (fun _ -> assert_equal expected (is_valid_matrix matrix) )  

  let test_suites = "is_valid_matrix" >::: [
      make_test_case "empty list" false [] ;
      make_test_case "empty int list" false [[]] ;
      make_test_case "more empty row vectors" false [[];[];[]];
      make_test_case "1-dim row vectors"  true  [[1];[2];[23]] ;
      make_test_case "row counts != colument counts"  false [[2];[23;4];[2;4]];
      make_test_case "3*3 matrix" true [[1;2;4];[3;4;5];[4;5;6]] ;
    ] 

  let _ = run_test_tt_main test_suites  
#+end_src


