ocaml-book/ch4/ex.html

<div id="outline-container-orga816fcc" class="outline-3">
<h3 id="orga816fcc"><span class="section-number-3">1.13.</span> more list fun</h3>
<div class="outline-text-3" id="text-1-13">
<p>
每次只用 <code>List.fold / List.map / List.filter</code> 中的一个编写下面的函数
</p>
<ul class="org-ul">
<li>找出list中那些长度&gt;3的字符串</li>
<li>为list中的每个元素加上 1.0</li>
<li>给定一个字符串的list <code>strs</code> ,以及一个字符串 <code>sep</code> , 生成一个由 <code>strs</code> 中的字符串组成且用 <code>sep</code> 分割的长字符串.
(确保没有多余的 <code>sep</code> )</li>
</ul>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">len_greater_then_three</span><span style="color: #DFDFDF;"> strs</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #FCCE7B;">List.</span>filter <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">s</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #FCCE7B;">String.</span>length s <span style="color: #f0e68c;">&gt;</span>3<span style="color: #f0e68c;">)</span> strs <span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">add_float_one</span><span style="color: #DFDFDF;"> lst</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #FCCE7B;">List.</span>map <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">x</span> <span style="color: #f0e68c;">-&gt;</span> x <span style="color: #f0e68c;">+.</span> 1.0<span style="color: #f0e68c;">)</span> lst <span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">concat_with_sep</span><span style="color: #DFDFDF;"> sep</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span> 
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #7bc275;">""</span>
  <span style="color: #f0e68c;">|</span> h<span style="color: #f0e68c;">::</span>t <span style="color: #f0e68c;">-&gt;</span> <span style="color: #FCCE7B;">List.</span>fold_left <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">acc e</span> <span style="color: #f0e68c;">-&gt;</span> acc <span style="color: #f0e68c;">^</span> sep <span style="color: #f0e68c;">^</span> e<span style="color: #f0e68c;">)</span> h t 
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org706e786" class="outline-3">
<h3 id="org706e786"><span class="section-number-3">1.14.</span> association list keys</h3>
<div class="outline-text-3" id="text-1-14">
<p>
association list 是一种字典的实现, 它是以pair为元素的list.
编写函数 <code>keys: ('a * 'b) list -&gt; 'a list</code> 根据association list返回由不重复的key构成的list
keys的顺序没有要求.
尽可能用一行实现该函数,并且其时间和空间复杂度都是线性的.
(提示: 使用 <code>List.sort_uniq</code> )
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">keys</span><span style="color: #DFDFDF;"> dict</span> <span style="color: #f0e68c;">=</span>
  dict <span style="color: #f0e68c;">|&gt;</span> <span style="color: #FCCE7B;">List.</span>map <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">k</span><span style="color: #f0e68c;">,</span><span style="color: #DFDFDF;">v</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">-&gt;</span> k<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">|&gt;</span> <span style="color: #FCCE7B;">List.</span>sort_uniq <span style="color: #FCCE7B;">Stdlib.</span>compare <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org90a3420" class="outline-3">
<h3 id="org90a3420"><span class="section-number-3">1.15.</span> valid matrix</h3>
<div class="outline-text-3" id="text-1-15">
<p>
用行向量的形式表示下面的矩阵为 <code>[[1; 1; 1]; [9; 8; 7]]</code>
</p>

\begin{split} \begin{bmatrix} 1 & 1 & 1 \\ 9 & 8 & 7 \end{bmatrix} \end{split}

<p>
一个有效的矩阵是一个至少有一行一列的 <code>int list list</code> ,且每列有相同的行数
</p>

<p>
下面这两个矩阵的表示都是无效的
</p>
<ul class="org-ul">
<li><code>[]</code></li>
<li><code>[[1; 2]; [3]]</code></li>
</ul>
<p>
实现一个函数 <code>is_valid_matrix: int list list -&gt; bool</code> ,它返回输入的矩阵表示是否有效.
并为该函数编写单元测试.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">open </span><span style="color: #FCCE7B;">OUnit2</span>
<span style="color: #f5deb3; font-weight: bold;">open </span><span style="color: #FCCE7B;">Stdlib</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">is_valid_matrix</span>  <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span>
    <span style="color: #f0e68c;">|[]</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #a991f1;">false</span>
    <span style="color: #f0e68c;">|[[]]</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #a991f1;">false</span> 
    <span style="color: #f0e68c;">|</span>r<span style="color: #f0e68c;">::</span>rows <span style="color: #f0e68c;">-&gt;</span> <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">l</span> <span style="color: #f0e68c;">=</span> <span style="color: #FCCE7B;">List.</span>length r <span style="color: #f5deb3; font-weight: bold;">in</span>
       <span style="color: #FCCE7B;">List.</span>fold_left <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">acc e</span> <span style="color: #f0e68c;">-&gt;</span>  <span style="color: #f0e68c;">(</span>l<span style="color: #f0e68c;">!=</span>0<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">&amp;&amp;</span> <span style="color: #f0e68c;">(</span><span style="color: #FCCE7B;">List.</span>length e <span style="color: #f0e68c;">=</span> l<span style="color: #f0e68c;">)</span>  <span style="color: #f0e68c;">&amp;&amp;</span> acc<span style="color: #f0e68c;">)</span>  <span style="color: #a991f1;">true</span> rows

<span style="color: #62686E;">(**************************</span><span style="color: #62686E;">UNIT TEST</span><span style="color: #62686E;">****************************)</span>
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">make_test_case</span><span style="color: #DFDFDF;">  name expected matrix</span> <span style="color: #f0e68c;">=</span>
  name <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_equal expected <span style="color: #f0e68c;">(</span>is_valid_matrix matrix<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">)</span>  

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">test_suites</span> <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"is_valid_matrix"</span> <span style="color: #f0e68c;">&gt;:::</span> <span style="color: #f0e68c;">[</span>
    make_test_case <span style="color: #7bc275;">"empty list"</span> <span style="color: #a991f1;">false</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">;</span>
    make_test_case <span style="color: #7bc275;">"empty int list"</span> <span style="color: #a991f1;">false</span> <span style="color: #f0e68c;">[[]]</span> <span style="color: #f0e68c;">;</span>
    make_test_case <span style="color: #7bc275;">"more empty row vectors"</span> <span style="color: #a991f1;">false</span> <span style="color: #f0e68c;">[[];[];[]];</span>
    make_test_case <span style="color: #7bc275;">"1-dim row vectors"</span>  <span style="color: #a991f1;">true</span>  <span style="color: #f0e68c;">[[</span>1<span style="color: #f0e68c;">];[</span>2<span style="color: #f0e68c;">];[</span>23<span style="color: #f0e68c;">]]</span> <span style="color: #f0e68c;">;</span>
    make_test_case <span style="color: #7bc275;">"row counts != colument counts"</span>  <span style="color: #a991f1;">false</span> <span style="color: #f0e68c;">[[</span>2<span style="color: #f0e68c;">];[</span>23<span style="color: #f0e68c;">;</span>4<span style="color: #f0e68c;">];[</span>2<span style="color: #f0e68c;">;</span>4<span style="color: #f0e68c;">]];</span>
    make_test_case <span style="color: #7bc275;">"3*3 matrix"</span> <span style="color: #a991f1;">true</span> <span style="color: #f0e68c;">[[</span>1<span style="color: #f0e68c;">;</span>2<span style="color: #f0e68c;">;</span>4<span style="color: #f0e68c;">];[</span>3<span style="color: #f0e68c;">;</span>4<span style="color: #f0e68c;">;</span>5<span style="color: #f0e68c;">];[</span>4<span style="color: #f0e68c;">;</span>5<span style="color: #f0e68c;">;</span>6<span style="color: #f0e68c;">]]</span> <span style="color: #f0e68c;">;</span>
  <span style="color: #f0e68c;">]</span> 

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">=</span> run_test_tt_main test_suites  
</pre>
</div>
</div>
</div>
