ocaml-book/ch4/ex.org
** row vector add
实现函数 =add_row_vectors: int list -> int list -> int list= 完成两个向量的按位加法.
当两个向量的维数不同时的行为是未知的,由实现者自己决定.
(提示: 使用List.map2 能编写一个只有一行的优雅实现)
并为此函数编写单元测试.

#+begin_src ocaml
open OUnit2
open Stdlib

(*
let add_row_vectors v1 v2 =
  if List.length v1 != List.length v2 then failwith "two vectors must have same dim"
  else 
    let rec impl acc v1 v2 =
      match (v1,v2) with 
      | (h1::t1,h2::t2) -> impl ((h1 + h2)::acc) t1 t2
      | _ -> List.rev acc
    in  impl [] v1 v2
;;
*)

let map2 op lst1 lst2 =
  if List.length lst1 != List.length lst2 then raise ( Invalid_argument "two lists should have same length" )
  else
    let rec loop acc l1 l2 = match (l1,l2) with
      | (h1::t1, h2::t2) -> loop ((op h1 h2)::acc) t1 t2
      | _ -> List.rev acc
    in loop [] lst1 lst2
;;
               
      
let add_row_vectors = map2 ( + ) ;;

let make_test_equal name  expected v1 v2 =
  name >:: (fun _ -> assert_equal expected  (add_row_vectors v1 v2) )

let make_test_raise name  v1 v2 =
  name >:: (fun _ -> assert_raises (Invalid_argument "two lists should have same length") (fun _ -> add_row_vectors v1 v2) ) 
  

let test_add_row_vectors = "add_row_vectors" >:::[
    make_test_equal "empty vectors" [] [] [] ;
    make_test_raise "different length" [2;4] [2;4;5];
    make_test_equal "add 3-dim vectors" [4;4;4]  [1;2;3] [3;2;1] ; 
  ]


let _ = run_test_tt_main test_add_row_vectors 

#+end_src

** matrix add
编写函数 =add_matrices: int list list -> int list list -> int list list=
若两个矩阵的大小不匹配, 则行为未定义. 
(提示: 使用List.map2 和上一问实现的函数 能编写一个只有一行的优雅实现)
并为此函数编写单元测试.

