ocaml-book/ch4/ex.html


<div id="outline-container-org65f36e6" class="outline-3">
<h3 id="org65f36e6"><span class="section-number-3">1.16.</span> row vector add</h3>
<div class="outline-text-3" id="text-1-16">
<p>
实现函数 <code>add_row_vectors: int list -&gt; int list -&gt; int list</code> 完成两个向量的按位加法.
当两个向量的维数不同时的行为是未知的,由实现者自己决定.
(提示: 使用List.map2 能编写一个只有一行的优雅实现)
并为此函数编写单元测试.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">open </span><span style="color: #FCCE7B;">OUnit2</span>
<span style="color: #f5deb3; font-weight: bold;">open </span><span style="color: #FCCE7B;">Stdlib</span>

<span style="color: #62686E;">(*</span>
<span style="color: #62686E;">let add_row_vectors v1 v2 =</span>
<span style="color: #62686E;">  if List.length v1 != List.length v2 then failwith "two vectors must have same dim"</span>
<span style="color: #62686E;">  else </span>
<span style="color: #62686E;">    let rec impl acc v1 v2 =</span>
<span style="color: #62686E;">      match (v1,v2) with </span>
<span style="color: #62686E;">      | (h1::t1,h2::t2) -&gt; impl ((h1 + h2)::acc) t1 t2</span>
<span style="color: #62686E;">      | _ -&gt; List.rev acc</span>
<span style="color: #62686E;">    in  impl [] v1 v2</span>
<span style="color: #62686E;">;;</span>
<span style="color: #62686E;">*)</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">map2</span><span style="color: #DFDFDF;"> op lst1 lst2</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> <span style="color: #FCCE7B;">List.</span>length lst1 <span style="color: #f0e68c;">!=</span> <span style="color: #FCCE7B;">List.</span>length lst2 <span style="color: #51afef;">then</span> <span style="color: #C57BDB;">raise</span> <span style="color: #f0e68c;">(</span> <span style="color: #C57BDB;">Invalid_argument</span> <span style="color: #7bc275;">"two lists should have same length"</span> <span style="color: #f0e68c;">)</span>
  <span style="color: #51afef;">else</span>
    <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">loop</span><span style="color: #DFDFDF;"> acc l1 l2</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">match</span> <span style="color: #f0e68c;">(</span>l1<span style="color: #f0e68c;">,</span>l2<span style="color: #f0e68c;">)</span> <span style="color: #51afef;">with</span>
      <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">(</span>h1<span style="color: #f0e68c;">::</span>t1<span style="color: #f0e68c;">,</span> h2<span style="color: #f0e68c;">::</span>t2<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">-&gt;</span> loop <span style="color: #f0e68c;">((</span>op h1 h2<span style="color: #f0e68c;">)::</span>acc<span style="color: #f0e68c;">)</span> t1 t2
      <span style="color: #f0e68c;">|</span> _ <span style="color: #f0e68c;">-&gt;</span> <span style="color: #FCCE7B;">List.</span>rev acc
    <span style="color: #f5deb3; font-weight: bold;">in</span> loop <span style="color: #f0e68c;">[]</span> lst1 lst2
<span style="color: #ff4500;">;;</span>


<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">add_row_vectors</span> <span style="color: #f0e68c;">=</span> map2 <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">+</span> <span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">make_test_equal</span><span style="color: #DFDFDF;"> name  expected v1 v2</span> <span style="color: #f0e68c;">=</span>
  name <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_equal expected  <span style="color: #f0e68c;">(</span>add_row_vectors v1 v2<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">)</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">make_test_raise</span><span style="color: #DFDFDF;"> name  v1 v2</span> <span style="color: #f0e68c;">=</span>
  name <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_raises <span style="color: #f0e68c;">(</span><span style="color: #C57BDB;">Invalid_argument</span> <span style="color: #7bc275;">"two lists should have same length"</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> add_row_vectors v1 v2<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">)</span> 


<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">test_add_row_vectors</span> <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"add_row_vectors"</span> <span style="color: #f0e68c;">&gt;:::[</span>
    make_test_equal <span style="color: #7bc275;">"empty vectors"</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">;</span>
    make_test_raise <span style="color: #7bc275;">"different length"</span> <span style="color: #f0e68c;">[</span>2<span style="color: #f0e68c;">;</span>4<span style="color: #f0e68c;">]</span> <span style="color: #f0e68c;">[</span>2<span style="color: #f0e68c;">;</span>4<span style="color: #f0e68c;">;</span>5<span style="color: #f0e68c;">];</span>
    make_test_equal <span style="color: #7bc275;">"add 3-dim vectors"</span> <span style="color: #f0e68c;">[</span>4<span style="color: #f0e68c;">;</span>4<span style="color: #f0e68c;">;</span>4<span style="color: #f0e68c;">]</span>  <span style="color: #f0e68c;">[</span>1<span style="color: #f0e68c;">;</span>2<span style="color: #f0e68c;">;</span>3<span style="color: #f0e68c;">]</span> <span style="color: #f0e68c;">[</span>3<span style="color: #f0e68c;">;</span>2<span style="color: #f0e68c;">;</span>1<span style="color: #f0e68c;">]</span> <span style="color: #f0e68c;">;</span> 
  <span style="color: #f0e68c;">]</span>


<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">=</span> run_test_tt_main test_add_row_vectors 

</pre>
</div>
</div>
</div>

<div id="outline-container-org24f31f0" class="outline-3">
<h3 id="org24f31f0"><span class="section-number-3">1.17.</span> matrix add</h3>
<div class="outline-text-3" id="text-1-17">
<p>
编写函数 <code>add_matrices: int list list -&gt; int list list -&gt; int list list</code>
若两个矩阵的大小不匹配, 则行为未定义. 
(提示: 使用List.map2 和上一问实现的函数 能编写一个只有一行的优雅实现)
并为此函数编写单元测试.
</p>
</div>
</div>
