ocaml-book/ch4/ex.html

<div id="outline-container-orgc9651da" class="outline-3">
<h3 id="orgc9651da"><span class="section-number-3">1.18.</span> matrix multiply</h3>
<div class="outline-text-3" id="text-1-18">
<p>
编写函数 <code>multiply_matrices: int list list -&gt; int list list -&gt; int list list</code>
若两个矩阵的维数无法匹配, 则行为是未定义的. 
(提示: 定义两个函数,一个实现矩阵的转置,另一个实现行向量的点积)
并为此函数编写单元测试.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #7e7e87;">(** matrix.ml *)</span>
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">is_valid_matrix</span>  <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span>
    <span style="color: #f0e68c;">|[]</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #a991f1;">false</span>
    <span style="color: #f0e68c;">|[[]]</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #a991f1;">false</span> 
    <span style="color: #f0e68c;">|</span>r<span style="color: #f0e68c;">::</span>rows <span style="color: #f0e68c;">-&gt;</span> <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">l</span> <span style="color: #f0e68c;">=</span> <span style="color: #FCCE7B;">List.</span>length r <span style="color: #f5deb3; font-weight: bold;">in</span>
       <span style="color: #FCCE7B;">List.</span>fold_left <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">acc e</span> <span style="color: #f0e68c;">-&gt;</span>  <span style="color: #f0e68c;">(</span>l<span style="color: #f0e68c;">!=</span>0<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">&amp;&amp;</span> <span style="color: #f0e68c;">(</span><span style="color: #FCCE7B;">List.</span>length e <span style="color: #f0e68c;">=</span> l<span style="color: #f0e68c;">)</span>  <span style="color: #f0e68c;">&amp;&amp;</span> acc<span style="color: #f0e68c;">)</span>  <span style="color: #a991f1;">true</span> rows 

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">fold_map</span><span style="color: #DFDFDF;">  op init f lst1 lst2</span>  <span style="color: #f0e68c;">=</span>
    <span style="color: #51afef;">if</span> <span style="color: #FCCE7B;">List.</span>length lst1 <span style="color: #f0e68c;">!=</span> <span style="color: #FCCE7B;">List.</span>length lst2 <span style="color: #51afef;">then</span> <span style="color: #C57BDB;">raise</span> <span style="color: #f0e68c;">(</span> <span style="color: #C57BDB;">Invalid_argument</span> <span style="color: #7bc275;">"two lists should have same length"</span> <span style="color: #f0e68c;">)</span>
    <span style="color: #51afef;">else</span>
    <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">loop</span><span style="color: #DFDFDF;"> acc l1 l2</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">match</span> <span style="color: #f0e68c;">(</span>l1<span style="color: #f0e68c;">,</span>l2<span style="color: #f0e68c;">)</span> <span style="color: #51afef;">with</span>
      <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">(</span>h1<span style="color: #f0e68c;">::</span>t1<span style="color: #f0e68c;">,</span> h2<span style="color: #f0e68c;">::</span>t2<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">-&gt;</span> loop <span style="color: #f0e68c;">(</span>op <span style="color: #f0e68c;">(</span>f h1 h2<span style="color: #f0e68c;">)</span> acc<span style="color: #f0e68c;">)</span> t1 t2
      <span style="color: #f0e68c;">|</span> _ <span style="color: #f0e68c;">-&gt;</span> acc
    <span style="color: #f5deb3; font-weight: bold;">in</span> loop init lst1 lst2
<span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">map2</span><span style="color: #DFDFDF;"> f l1 l2</span>  <span style="color: #f0e68c;">=</span><span style="color: #FCCE7B;">List.</span>rev <span style="color: #f0e68c;">(</span>fold_map <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">e acc</span> <span style="color: #f0e68c;">-&gt;</span> e<span style="color: #f0e68c;">::</span>acc<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">[]</span> f l1 l2<span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">add_row_vectors</span> <span style="color: #f0e68c;">=</span> map2 <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">+</span> <span style="color: #f0e68c;">)</span> 

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">add_matrices</span> <span style="color: #f0e68c;">=</span> map2 add_row_vectors <span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">dot_product_row_vectors</span> <span style="color: #f0e68c;">=</span> fold_map <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">+</span> <span style="color: #f0e68c;">)</span> 0 <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">*</span> <span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">colu_vector_of_row_vector</span>  <span style="color: #f0e68c;">=</span> <span style="color: #FCCE7B;">List.</span>map <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">e</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #f0e68c;">[</span>e<span style="color: #f0e68c;">]</span> <span style="color: #f0e68c;">)</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">cons_colu_and_row</span><span style="color: #DFDFDF;"> colu row</span> <span style="color: #f0e68c;">=</span>  map2 <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">@</span> <span style="color: #f0e68c;">)</span>  colu <span style="color: #f0e68c;">(</span>colu_vector_of_row_vector row<span style="color: #f0e68c;">)</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">transpose_matrix</span><span style="color: #DFDFDF;"> m</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> <span style="color: #f0e68c;">not(</span>is_valid_matrix m<span style="color: #f0e68c;">)</span> <span style="color: #51afef;">then</span> <span style="color: #C57BDB;">raise</span> <span style="color: #f0e68c;">(</span><span style="color: #C57BDB;">Invalid_argument</span> <span style="color: #7bc275;">"the input matrix is invalid"</span><span style="color: #f0e68c;">)</span>
  <span style="color: #51afef;">else</span>
    <span style="color: #51afef;">match</span> m <span style="color: #51afef;">with</span>
    <span style="color: #f0e68c;">|</span> h<span style="color: #f0e68c;">::</span>t <span style="color: #f0e68c;">-&gt;</span> <span style="color: #FCCE7B;">List.</span>fold_left  cons_colu_and_row  <span style="color: #f0e68c;">(</span>colu_vector_of_row_vector h<span style="color: #f0e68c;">)</span> t
    <span style="color: #f0e68c;">|</span> _ <span style="color: #f0e68c;">-&gt;</span> <span style="color: #C57BDB;">raise</span> <span style="color: #f0e68c;">(</span><span style="color: #C57BDB;">Invalid_argument</span> <span style="color: #7bc275;">"the input matrix is invalid"</span><span style="color: #f0e68c;">)</span> 
<span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">multiply_matrices</span><span style="color: #DFDFDF;"> m1 m2</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">n</span> <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">(</span>transpose_matrix m2<span style="color: #f0e68c;">)</span> <span style="color: #f5deb3; font-weight: bold;">in</span>
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">impl</span><span style="color: #DFDFDF;"> acc m1</span> <span style="color: #f0e68c;">=</span> 
    <span style="color: #51afef;">match</span> m1 <span style="color: #51afef;">with</span>
    <span style="color: #f0e68c;">|[]</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #FCCE7B;">List.</span>rev acc 
    <span style="color: #f0e68c;">|</span>row<span style="color: #f0e68c;">::</span>rest  <span style="color: #f0e68c;">-&gt;</span>   impl <span style="color: #f0e68c;">((</span><span style="color: #FCCE7B;">List.</span>map  <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">x</span> <span style="color: #f0e68c;">-&gt;</span> dot_product_row_vectors x row<span style="color: #f0e68c;">)</span> n  <span style="color: #f0e68c;">)::</span>acc<span style="color: #f0e68c;">)</span> rest 
  <span style="color: #f5deb3; font-weight: bold;">in</span> impl <span style="color: #f0e68c;">[]</span> m1
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
